Tekla.Structures.DialogInternal.CoreInpDialogInterface
Handles access to object dialog callbacks in core

Tekla.Structures.DialogInternal.CoreInpDialogInterface.callback
The callback

Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedEvent
The rebar attribute requested event

Tekla.Structures.DialogInternal.CoreInpDialogInterface.shapeCallback
The shape attribute selection callback

Tekla.Structures.DialogInternal.CoreInpDialogInterface.ShapeAttributeRequestedEvent
The shape attribute requested event

Tekla.Structures.DialogInternal.CoreInpDialogInterface.Register(System.String)
Register callback to core
param: Not used
Returns: 1, always

Tekla.Structures.DialogInternal.CoreInpDialogInterface.Unregister
Unregister callback from core

Tekla.Structures.DialogInternal.CoreInpDialogInterface.ProcessValueChanged(System.IntPtr,System.String)
Notify core about changed value
handle: Native dialog handle
parameter: New value to be sent to INP dialog

Tekla.Structures.DialogInternal.CoreInpDialogInterface.FreeHandle(System.IntPtr@)
Free core dialog handle
handle: Native dialog handle

Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedCallback(System.IntPtr,System.String,System.String,System.Double,System.Int32)
Rebar catalog callback function to be called from native INP dialog
handle: Native dialog handle
size: Rebar size
grade: Rebar grade
radius: Rebar radius
usage: Rebar usage
Returns: 1, always

Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedCallback(System.IntPtr,System.String)
Shape catalog callback function to be called from native INP dialog
handle: Native dialog handle
shape: Shape name
Returns: 1, always